sharmarkeahmed/predictive-humidity-controller/firmware/stm32/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdbool.h>
#include <string.h>
#include <stdio.h>

#include "esp8266_uart.h"
#include "sht3x.h"

#include "XPT2046.h"
#include "ILI9341.h"

#include "ControlLoop.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
typedef enum
{
  HUMIDITY_LED_IDLE = 0,
  HUMIDITY_LED_INCREASING,
  HUMIDITY_LED_DECREASING
} HumidityLedState_t;
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define ENABLE_ESP8266_UART  1  /* Set 1 to enable ESP8266 forecast receive task */
#define ENABLE_SHT3X         1  /* Set 1 to enable SHT3X task                   */
#define ENABLE_LCD_SPI1      1  /* Set 1 to enable LCD task                      */

/* --- Humidity status LEDs on GPIOC --- */
#define HUMIDITY_LED_GREEN_PORT   GPIOC
#define HUMIDITY_LED_GREEN_PIN    GPIO_PIN_4

#define HUMIDITY_LED_RED_PORT     GPIOC
#define HUMIDITY_LED_RED_PIN      GPIO_PIN_5

/* --- Display GPIO (all on GPIOB) ----------------------------------------- */
#define TFT_RST_PORT   GPIOB
#define TFT_RST_PIN    GPIO_PIN_5

#define TFT_CS_PORT    GPIOB
#define TFT_CS_PIN     GPIO_PIN_6

#define TFT_DC_PORT    GPIOB
#define TFT_DC_PIN     GPIO_PIN_7

/* --- Touchscreen GPIO ---------------------------------------------------- */
#define TS_CS_PORT     GPIOB
#define TS_CS_PIN      GPIO_PIN_4

#define TS_IRQ_PORT    GPIOB
#define TS_IRQ_PIN     GPIO_PIN_2   /* EXTI2, falling edge, pull-up */

/* --- Touch poll interval -------------------------------------------------- */
#define TOUCH_POLL_MS       20U   /* GPIO check interval                      */
#define TOUCH_DEBOUNCE_MS   50U   /* confirm delay after first detection       */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c2;

SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim1;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;

/* Definitions for defaultTask */
osThreadId_t defaultTaskHandle;
const osThreadAttr_t defaultTask_attributes = {
  .name = "defaultTask",
  .stack_size = 128 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* USER CODE BEGIN PV */

/* --- RTOS thread handles -------------------------------------------------- */
osThreadId_t esp8266TaskHandle;
const osThreadAttr_t esp8266Task_attributes = {
  .name       = "Esp8266Task",
  .stack_size = 256 * 4,
  .priority   = (osPriority_t) osPriorityLow,
};

osThreadId_t sht3xTaskHandle;
const osThreadAttr_t sht3xTask_attributes = {
  .name       = "Sht3xTask",
  .stack_size = 256 * 4,
  .priority   = (osPriority_t) osPriorityBelowNormal,
};

osThreadId_t lcdTaskHandle;
const osThreadAttr_t lcdTask_attributes = {
  .name       = "LCDTask",
  .stack_size = 512 * 4,   /* increased: printf + display buffers */
  .priority   = (osPriority_t) osPriorityBelowNormal,
};

osThreadId_t controlTaskHandle;
const osThreadAttr_t controlTask_attributes = {
  .name       = "ControlTask",
  .stack_size = 256 * 4,
  .priority   = (osPriority_t) osPriorityAboveNormal,
};

/* --- Touch semaphore ---------------------------------------------------- */
osSemaphoreId_t touchSemHandle;
const osSemaphoreAttr_t touchSem_attributes = {
  .name = "touchSem"
};

/* --- Display / touch driver instances ------------------------------------ */
ILI9341_t3  tft;   /* populated by ILI9341_init() in StartLCDTask          */
XPT2046_t   ts;    /* populated by XPT2046_init() in StartLCDTask           */

/* --- ESP8266 globals ------------------------------------------------------- */
static esp8266_uart_t        esp8266_uart_state;
volatile esp8266_forecast_t  g_esp8266_forecast        = {0};
volatile uint32_t            g_esp8266_frame_count     = 0;
volatile uint32_t            g_esp8266_frame_error_count = 0;
volatile HAL_StatusTypeDef   g_esp8266_last_error      = HAL_OK;
volatile bool                g_esp8266_uart_ready      = false;
volatile bool                g_esp8266_forecast_valid  = false;

/* --- SHT3x globals -------------------------------------------------------- */
static sht3x_t               sht3x_sensor;
volatile sht3x_sample_t      g_sht3x_sample      = {0};
volatile uint32_t            g_sht3x_read_count  = 0;
volatile uint32_t            g_sht3x_error_count = 0;
volatile HAL_StatusTypeDef   g_sht3x_last_error  = HAL_OK;
volatile bool                g_sht3x_sensor_ready = false;
volatile bool                g_sht3x_sample_valid = false;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_TIM1_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_SPI1_Init(void);
static void MX_I2C2_Init(void);
void StartDefaultTask(void *argument);

/* USER CODE BEGIN PFP */
void StartEsp8266Task(void *argument);
void StartSht3xTask(void *argument);
void StartLCDTask(void *argument);
void StartControlTask(void *argument);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
extern esp8266_uart_t esp8266_uart_state;
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */
  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

