sharmarkeahmed/predictive-humidity-controller/firmware/stm32/Core/Src/main.c
void StartEsp8266Task(void *argument)
{
    (void)argument;

#if ENABLE_ESP8266_UART

    // Initialize UART driver
    g_esp8266_uart_ready = esp8266_uart_init(&esp8266_uart_state, &huart1);

    for (;;)
    {
        if (!g_esp8266_uart_ready)
        {
            osDelay(ESP8266_UART_TASK_RETRY_DELAY_MS);
            continue;
        }

        // Wait for a full forecast frame
        if (esp8266_uart_receive_frame(&esp8266_uart_state,
                                       ESP8266_UART_TASK_RX_TIMEOUT_MS))
        {
            if (esp8266_uart_get_latest_forecast(&esp8266_uart_state,
                                                 (esp8266_forecast_t*)&g_esp8266_forecast))
            {
                g_esp8266_forecast_valid = true;
                g_esp8266_frame_count++;
            }

            esp8266_uart_clear_forecast_flag(&esp8266_uart_state);
        }
        else
        {
            g_esp8266_frame_error_count++;
            osDelay(ESP8266_UART_TASK_RETRY_DELAY_MS);
        }
    }

#else
    for (;;)
    {
        osDelay(1000);
    }
#endif
}

/* --------------------------------------------------------------------------
 * HAL_GPIO_EXTI_Callback
 * No touch IRQ handling needed - touch is polled via GPIO + SPI.
 * PC13 (user button) IRQ is cleared here to prevent Default_Handler trap.
 * -------------------------------------------------------------------------- */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
    if (GPIO_Pin == TS_IRQ_PIN)
    {
        XPT2046_irqHandler(&ts);

        /* Wake the LCD task – use FromISR-safe FreeRTOS call */
        osSemaphoreRelease(touchSemHandle);
    }
    /* PC13 user button – not used */
}
///* --------------------------------------------------------------------------
// * draw touch point
// * -------------------------------------------------------------------------- */
//static void draw_point(int16_t x, int16_t y)
//{
//  ILI9341_fillCircle(&tft, x, y, 5, ILI9341_RED);
//}

/* Touch calibration structure */
typedef struct {
    int16_t x_min;      /* Minimum X raw value (usually top-left) */
    int16_t x_max;      /* Maximum X raw value (usually bottom-right) */
    int16_t y_min;      /* Minimum Y raw value (usually top-left) */
    int16_t y_max;      /* Maximum Y raw value (usually bottom-right) */
    bool calibrated;
} TouchCalibration;

TouchCalibration touch_cal = {0};


// BUNCH OF HELPER FUNCTIONS FOR DEBUG UNCOMMENT, NOT CALLED IN MAIN
///* Function to display calibration instructions and wait for touch */
//TS_Point wait_for_touch_with_indicator(XPT2046_t *ts, ILI9341_t3 *tft,
//                                        int16_t target_x, int16_t target_y,
//                                        const char *message)
//{
//    TS_Point point;
//
//    /* Clear area and show instruction */
//    ILI9341_fillRect(tft, 0, tft->_height - 40, tft->_width, 40, ILI9341_BLACK);
//    ILI9341_setTextSize(tft, 1);
//    ILI9341_setTextColorBG(tft, ILI9341_YELLOW, ILI9341_BLACK);
//    ILI9341_setCursor(tft, 10, tft->_height - 30);
//    ILI9341_writeString(tft, message);
//
//    /* Draw target circle */
//    ILI9341_fillCircle(tft, target_x, target_y, 10, ILI9341_RED);
//    ILI9341_drawCircle(tft, target_x, target_y, 12, ILI9341_WHITE);
//
//    /* Wait for touch */
//    while (1) {
//        if (XPT2046_touched(ts)) {
//            point = XPT2046_getPoint(ts);
//
//            /* Show raw values while touching */
//            char raw_str[32];
//            ILI9341_fillRect(tft, 0, tft->_height - 20, 200, 20, ILI9341_BLACK);
//            ILI9341_setTextSize(tft, 1);
//            ILI9341_setTextColorBG(tft, ILI9341_CYAN, ILI9341_BLACK);
//            ILI9341_setCursor(tft, 10, tft->_height - 15);
//            sprintf(raw_str, "Raw: X=%4d Y=%4d", point.x, point.y);
//            ILI9341_writeString(tft, raw_str);
//
//            /* Wait for touch release */
//            while (XPT2046_touched(ts)) {
//                osDelay(10);
//            }
//
//            /* Confirm with user */
//            ILI9341_fillRect(tft, 0, tft->_height - 40, tft->_width, 40, ILI9341_BLACK);
//            ILI9341_setTextColorBG(tft, ILI9341_GREEN, ILI9341_BLACK);
//            ILI9341_setCursor(tft, 10, tft->_height - 30);
//            ILI9341_writeString(tft, "Touch registered! Releasing...");
//            osDelay(500);
//
//            break;
//        }
//        osDelay(10);
//    }
//
//    /* Clear the target circle */
//    ILI9341_fillCircle(tft, target_x, target_y, 12, ILI9341_BLACK);
//
//    return point;
//}
//
///* Calibration routine */
//bool calibrate_touchscreen(XPT2046_t *ts, ILI9341_t3 *tft)
//{
//    TS_Point points[4];
//    int16_t screen_points[4][2] = {
//        {10, 10},           /* Top-left */
//        {tft->_width - 10, 10},  /* Top-right */
//        {10, tft->_height - 10}, /* Bottom-left */
//        {tft->_width - 10, tft->_height - 10}  /* Bottom-right */
//    };
//
//    const char *messages[] = {
//        "Touch the RED circle at TOP-LEFT corner",
//        "Touch the RED circle at TOP-RIGHT corner",
//        "Touch the RED circle at BOTTOM-LEFT corner",
//        "Touch the RED circle at BOTTOM-RIGHT corner"
//    };
//
//    ILI9341_fillScreen(tft, ILI9341_BLACK);
//    ILI9341_setTextSize(tft, 2);
//    ILI9341_setTextColorBG(tft, ILI9341_WHITE, ILI9341_BLACK);
//    ILI9341_setCursor(tft, 10, 10);
//    ILI9341_writeString(tft, "Touch Screen Calibration");
//    ILI9341_setCursor(tft, 10, 40);
//    ILI9341_writeString(tft, "Follow the instructions");
//    osDelay(2000);
//
//    /* Collect calibration points */
//    for (int i = 0; i < 4; i++) {
//        points[i] = wait_for_touch_with_indicator(ts, tft,
//                                                   screen_points[i][0],
//                                                   screen_points[i][1],
//                                                   messages[i]);
//
//        /* Validate raw values are within range */
//        if (points[i].x < 0 || points[i].x > 4095 ||
//            points[i].y < 0 || points[i].y > 4095) {
//            ILI9341_fillScreen(tft, ILI9341_BLACK);
//            ILI9341_setTextColorBG(tft, ILI9341_RED, ILI9341_BLACK);
//            ILI9341_setCursor(tft, 10, 10);
//            ILI9341_writeString(tft, "Calibration Error!");
//            ILI9341_setCursor(tft, 10, 40);
//            ILI9341_writeString(tft, "Invalid touch values");
//            osDelay(2000);
//            return false;
//        }
//    }
//
//    /* Calculate min/max values */
//    touch_cal.x_min = points[0].x;
//    touch_cal.x_max = points[0].x;
//    touch_cal.y_min = points[0].y;
//    touch_cal.y_max = points[0].y;
//
//    for (int i = 1; i < 4; i++) {
//        if (points[i].x < touch_cal.x_min) touch_cal.x_min = points[i].x;
//        if (points[i].x > touch_cal.x_max) touch_cal.x_max = points[i].x;
//        if (points[i].y < touch_cal.y_min) touch_cal.y_min = points[i].y;
//        if (points[i].y > touch_cal.y_max) touch_cal.y_max = points[i].y;
//    }
//
//    /* Add a small margin */
//    touch_cal.x_min -= 20;
//    touch_cal.x_max += 20;
//    touch_cal.y_min -= 20;
//    touch_cal.y_max += 20;
//
//    /* Clamp to valid range */
//    if (touch_cal.x_min < 0) touch_cal.x_min = 0;
//    if (touch_cal.x_max > 4095) touch_cal.x_max = 4095;
//    if (touch_cal.y_min < 0) touch_cal.y_min = 0;
//    if (touch_cal.y_max > 4095) touch_cal.y_max = 4095;
//
//    touch_cal.calibrated = true;
//
//    /* Show calibration results */
//    ILI9341_fillScreen(tft, ILI9341_BLACK);
//    ILI9341_setTextSize(tft, 2);
//    ILI9341_setTextColorBG(tft, ILI9341_GREEN, ILI9341_BLACK);
//    ILI9341_setCursor(tft, 10, 10);
//    ILI9341_writeString(tft, "Calibration Complete!");
//
//    ILI9341_setTextSize(tft, 1);
//    ILI9341_setTextColorBG(tft, ILI9341_WHITE, ILI9341_BLACK);
//    ILI9341_setCursor(tft, 10, 50);
//    char buf[64];
//    sprintf(buf, "X Range: %d - %d", touch_cal.x_min, touch_cal.x_max);
//    ILI9341_writeString(tft, buf);
//    ILI9341_setCursor(tft, 10, 70);
//    sprintf(buf, "Y Range: %d - %d", touch_cal.y_min, touch_cal.y_max);
//    ILI9341_writeString(tft, buf);
//
//    ILI9341_setCursor(tft, 10, 100);
//    ILI9341_writeString(tft, "Touch anywhere to test");
//
//    /* Test calibration */
//    while (1) {
//        if (XPT2046_touched(ts)) {
//            TS_Point test = XPT2046_getPoint(ts);
//
//            /* Convert raw to screen coordinates */
//            int16_t screen_x = (int16_t)((uint32_t)(test.x - touch_cal.x_min) *
//                                         tft->_width / (touch_cal.x_max - touch_cal.x_min));
//            int16_t screen_y = (int16_t)((uint32_t)(test.y - touch_cal.y_min) *
//                                         tft->_height / (touch_cal.y_max - touch_cal.y_min));
//
//            /* Clamp to screen bounds */
//            if (screen_x < 0) screen_x = 0;
//            if (screen_x >= tft->_width) screen_x = tft->_width - 1;
//            if (screen_y < 0) screen_y = 0;
//            if (screen_y >= tft->_height) screen_y = tft->_height - 1;
//
//            /* Show calibrated coordinates */
//            ILI9341_fillRect(tft, 10, 130, 220, 50, ILI9341_BLACK);
//            ILI9341_setTextSize(tft, 2);
//            ILI9341_setTextColorBG(tft, ILI9341_YELLOW, ILI9341_BLACK);
//            ILI9341_setCursor(tft, 10, 130);
//            sprintf(buf, "X:%3d Y:%3d", screen_x, screen_y);
//            ILI9341_writeString(tft, buf);
//
//            /* Draw touch point */
//            ILI9341_fillCircle(tft, screen_x, screen_y, 5, ILI9341_RED);
//
//            /* Wait for touch release */
//            while (XPT2046_touched(ts)) {
//                osDelay(10);
//            }
//
//            /* Clear touch point */
//            ILI9341_fillCircle(tft, screen_x, screen_y, 5, ILI9341_BLACK);
//        }
//        osDelay(10);
//    }
//
//    return true;
//}
//
///* Function to convert raw touch coordinates to screen coordinates */
//bool touch_to_screen(XPT2046_t *ts, int16_t *screen_x, int16_t *screen_y)
//{
//    if (!touch_cal.calibrated) {
//        return false;
//    }
//
//    TS_Point raw = XPT2046_getPoint(ts);
//
//    /* Apply rotation first (if needed) */
//    int16_t raw_x = raw.x;
//    int16_t raw_y = raw.y;
//
//    /* Convert raw values to screen coordinates using calibration */
//    *screen_x = (int16_t)((uint32_t)(raw_x - touch_cal.x_min) *
//                          ILI9341_width(&tft) / (touch_cal.x_max - touch_cal.x_min));
//    *screen_y = (int16_t)((uint32_t)(raw_y - touch_cal.y_min) *
//                          ILI9341_height(&tft) / (touch_cal.y_max - touch_cal.y_min));
//
//    /* Clamp to screen bounds */
//    if (*screen_x < 0) *screen_x = 0;
//    if (*screen_x >= ILI9341_width(&tft)) *screen_x = ILI9341_width(&tft) - 1;
//    if (*screen_y < 0) *screen_y = 0;
//    if (*screen_y >= ILI9341_height(&tft)) *screen_y = ILI9341_height(&tft) - 1;
//
//    return true;
//}

void initLCD(void){
	/* Hard reset */
	    HAL_GPIO_WritePin(TFT_CS_PORT,  TFT_CS_PIN,  GPIO_PIN_SET);
	    HAL_GPIO_WritePin(TFT_DC_PORT,  TFT_DC_PIN,  GPIO_PIN_SET);
	    HAL_GPIO_WritePin(TFT_RST_PORT, TFT_RST_PIN, GPIO_PIN_SET);
	    osDelay(10);
	    HAL_GPIO_WritePin(TFT_RST_PORT, TFT_RST_PIN, GPIO_PIN_RESET);
	    osDelay(20);
	    HAL_GPIO_WritePin(TFT_RST_PORT, TFT_RST_PIN, GPIO_PIN_SET);
	    osDelay(150);
}

void StartLCDTask(void *argument)
{
    (void)argument;

