sharmarkeahmed/predictive-humidity-controller/firmware/stm32/Core/Src/main.c
    // ===== HARD RESET LCD =====
    HAL_GPIO_WritePin(TFT_CS_PORT, TFT_CS_PIN, GPIO_PIN_SET);
    HAL_GPIO_WritePin(TFT_DC_PORT, TFT_DC_PIN, GPIO_PIN_SET);
    HAL_GPIO_WritePin(TFT_RST_PORT, TFT_RST_PIN, GPIO_PIN_SET);
    osDelay(10);
    HAL_GPIO_WritePin(TFT_RST_PORT, TFT_RST_PIN, GPIO_PIN_RESET);
    osDelay(20);
    HAL_GPIO_WritePin(TFT_RST_PORT, TFT_RST_PIN, GPIO_PIN_SET);
    osDelay(150);

    // ===== INIT LCD =====
    ILI9341_init(&tft, &hspi1,
                 TFT_CS_PORT, TFT_CS_PIN,
                 TFT_DC_PORT, TFT_DC_PIN,
                 TFT_RST_PORT, TFT_RST_PIN);

    ILI9341_begin(&tft);
    osDelay(50);
    ILI9341_setRotation(&tft, 1);

    // ===== INIT TOUCH =====
    HAL_GPIO_WritePin(TS_CS_PORT, TS_CS_PIN, GPIO_PIN_SET);

    XPT2046_init(&ts, &hspi1,
                 TS_CS_PORT, TS_CS_PIN,
                 TS_IRQ_PORT, TS_IRQ_PIN);

    XPT2046_begin(&ts);
    XPT2046_setRotation(&ts, 1);

    // ===== CLEAR SCREEN =====
    ILI9341_fillScreen(&tft, ILI9341_BLACK);

    // Static title
    ILI9341_setTextColor(&tft, ILI9341_WHITE);
    ILI9341_setTextSize(&tft, 2);
    ILI9341_setCursor(&tft, 10, 10);
    ILI9341_writeString(&tft, "Forecast:");

    for (;;)
    {
        char buf[32];

        // ===== FORECAST (3 entries) =====
        if (g_esp8266_forecast_valid)
        {
            for (int i = 0; i < 3; i++)
            {
                int y = 40 + i * 20;
                int temp10 = (int)(g_esp8266_forecast.temperature_f[i] * 10);

                ILI9341_fillRect(&tft, 10, y, 220, 18, ILI9341_BLACK);

                snprintf(buf, sizeof(buf),
                         "%02d  %3d.%dF  %2d%%",
                         i,
                         temp10 / 10,
                         abs(temp10 % 10),
                         g_esp8266_forecast.humidity_percent[i]);

                ILI9341_setCursor(&tft, 10, y);
                ILI9341_writeString(&tft, buf);
            }
        }
        else
        {
            ILI9341_setCursor(&tft, 10, 40);
            ILI9341_writeString(&tft, "No Forecast");
        }

        // ===== SENSOR =====
        int sensor_y = 40 + 3 * 20 + 10;

        ILI9341_fillRect(&tft, 10, sensor_y, 220, 50, ILI9341_BLACK);


        if (g_sht3x_sample_valid)
        {
            ILI9341_setTextColor(&tft, ILI9341_GREEN);

            snprintf(buf, sizeof(buf),
                     "Hum:  %.1f%%",
                     g_sht3x_sample.humidity_percent);
            ILI9341_setCursor(&tft, 10, sensor_y + 20);
            ILI9341_writeString(&tft, buf);

            snprintf(buf, sizeof(buf),
                     "Temp: %.1fC",
                     g_sht3x_sample.temperature_c);
            ILI9341_setCursor(&tft, 10, sensor_y + 40);
            ILI9341_writeString(&tft, buf);
        }
        else
        {
            ILI9341_setTextColor(&tft, ILI9341_RED);
            ILI9341_setCursor(&tft, 10, sensor_y + 20);
            ILI9341_writeString(&tft, "Sensor Error");
        }

        // ===== CONTROL =====
        int control_y = sensor_y + 70;

        ILI9341_fillRect(&tft, 10, control_y, 220, 120, ILI9341_BLACK);

        // Setpoint
        ILI9341_setTextColor(&tft, ILI9341_CYAN);
        snprintf(buf, sizeof(buf),
                 "SP: %.1f%%",
                 g_target_humidity);
        ILI9341_setCursor(&tft, 10, control_y + 20);
        ILI9341_writeString(&tft, buf);

        // Humidifier
        ILI9341_setTextColor(&tft,
            g_humidifier_on ? ILI9341_GREEN : ILI9341_RED);

        snprintf(buf, sizeof(buf),
                 "Humid: %s",
                 g_humidifier_on ? "ON" : "OFF");
        ILI9341_setCursor(&tft, 10, control_y + 40);
        ILI9341_writeString(&tft, buf);

        // Dehumidifier
        ILI9341_setTextColor(&tft,
            g_dehumidifier_on ? ILI9341_GREEN : ILI9341_RED);

        snprintf(buf, sizeof(buf),
                 "Dehum: %s",
                 g_dehumidifier_on ? "ON" : "OFF");
        ILI9341_setCursor(&tft, 10, control_y + 60);
        ILI9341_writeString(&tft, buf);

        // Mode
        ILI9341_setTextColor(&tft, ILI9341_YELLOW);
        snprintf(buf, sizeof(buf),
                 "Mode: %s",
                 g_control_mode == MODE_AUTO ? "AUTO" :
                 g_control_mode == MODE_MANUAL ? "MAN" : "CAL");

        ILI9341_setCursor(&tft, 10, control_y + 80);
        ILI9341_writeString(&tft, buf);

        // Rate
        ILI9341_setTextColor(&tft, ILI9341_MAGENTA);
        snprintf(buf, sizeof(buf),
                 "Rate: %.2f%%/m",
                 g_measured_rate);

        ILI9341_setCursor(&tft, 10, control_y + 100);
        ILI9341_writeString(&tft, buf);

        osDelay(500);
    }
}

/* --------------------------------------------------------------------------
 * SHT3x task (unchanged from original)
 * -------------------------------------------------------------------------- */
void StartSht3xTask(void *argument)
{
  (void)argument;

#if ENABLE_SHT3X
  sht3x_sample_t sample;

  for (;;)
  {
    if (!sht3x_sensor.initialized)
    {
      g_sht3x_sensor_ready = sht3x_init(&sht3x_sensor, &hi2c2, SHT3X_I2C_ADDRESS);
      g_sht3x_last_error   = sht3x_sensor.last_error;

      if (!g_sht3x_sensor_ready)
      {
        g_sht3x_sample_valid = false;
        g_sht3x_error_count++;
        osDelay(SHT3X_TASK_RETRY_DELAY_MS);
        continue;
      }
    }

    if (sht3x_read(&sht3x_sensor, &sample))
    {
      g_sht3x_sample       = sample;
      g_sht3x_last_error   = HAL_OK;
      g_sht3x_sensor_ready = true;
      g_sht3x_sample_valid = true;
      g_sht3x_read_count++;
    }
    else
    {
      g_sht3x_last_error   = sht3x_sensor.last_error;
      g_sht3x_sensor_ready = false;
      g_sht3x_sample_valid = false;
      g_sht3x_error_count++;
    }

