sharmarkeahmed/predictive-humidity-controller/firmware/stm32/Core/Src/main.c
    osDelay(SHT3X_TASK_PERIOD_MS);
  }
#else
  for (;;) osDelay(1000);
#endif
}

void StartControlTask(void *argument)
{
    (void)argument;

    ControlLoop_Init();

    for (;;)
    {
        // Run control loop (uses real sensor + forecast)
        ControlLoop_Update();

        // Example:
        // HAL_GPIO_WritePin(HUMIDIFIER_GPIO_Port, HUMIDIFIER_Pin,
        //                   g_humidifier_on ? GPIO_PIN_SET : GPIO_PIN_RESET);
        //
        // HAL_GPIO_WritePin(DEHUMIDIFIER_GPIO_Port, DEHUMIDIFIER_Pin,
        //                   g_dehumidifier_on ? GPIO_PIN_SET : GPIO_PIN_RESET);

        if (g_humidifier_on)
           	    {
                    HumidityLED_SetState(HUMIDITY_LED_INCREASING);
                }
                else if (g_dehumidifier_on)
                {
                    HumidityLED_SetState(HUMIDITY_LED_DECREASING);
                }
                else
                {
                    HumidityLED_SetState(HUMIDITY_LED_IDLE);
                }
        osDelay(500);  // match sensor update rate (~0.5–1 sec is ideal)
    }
}
/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void *argument)
{
  /* USER CODE BEGIN 5 */
  (void)argument;

  for (;;)
  {
    osDelay(250);
  }

  /* USER CODE END 5 */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM5 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM5)
  {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
